trade_exp/src/DataProcessors/УправлениеПоступлением_Альтерра/УправлениеПоступлением_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>УправлениеПоступлением_Альтерра</name>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/РазмещениеНоменклатурыПоСкладскимЯчейкам/РазмещениеНоменклатурыПоСкладскимЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>РазмещениеНоменклатурыПоСкладскимЯчейкам</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>ОсновнаяЯчейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="7150e659-c510-45e5-9deb-fddf7441e996">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/РеестрДокументов/РеестрДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="44851db7-ace4-11e7-7088-f45c898df8f7">
  <name>РеестрДокументов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="448617a8-ace4-11e7-7088-f45c898df8f7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862216-ace4-11e7-7088-f45c898df8f7">
    <name>ПометкаУдаления</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44862720-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="4485debe-ace4-11e7-7088-f45c898df8f7">
    <name>НомерДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44862c2a-ace4-11e7-7088-f45c898df8f7">
    <name>НомерПервичногоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860178-ace4-11e7-7088-f45c898df8f7">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861d0c-ace4-11e7-7088-f45c898df8f7">
    <name>Проведен</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863b70-ace4-11e7-7088-f45c898df8f7">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863652-ace4-11e7-7088-f45c898df8f7">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="448607f4-ace4-11e7-7088-f45c898df8f7">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44863134-ace4-11e7-7088-f45c898df8f7">
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="44861276-ace4-11e7-7088-f45c898df8f7">
    <name>Дополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="44860d4e-ace4-11e7-7088-f45c898df8f7">
    <name>ДополнительнаяЗапись</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="c033ddc4-ace7-11e7-7088-f45c898df8f7">
    <name>ДатаОтраженияВУчете</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="831ffe7e-f3df-4095-a10b-b5fb3a077003">
    <name>СторнируемыйДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="9db0faa0-6639-4188-b1ae-45947ea159fa">
    <name>СторноИсправление</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="f67589b3-bd43-48f7-a0f9-db01f3da814e">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="448640c0-ace4-11e7-7088-f45c898df8f7">
    <name>ТипСсылки</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44864796-ace4-11e7-7088-f45c898df8f7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44867356-ace4-11e7-7088-f45c898df8f7">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44866bd6-ace4-11e7-7088-f45c898df8f7">
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448698e0-ace4-11e7-7088-f45c898df8f7">
    <name>Ссылка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448679be-ace4-11e7-7088-f45c898df8f7">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="448692aa-ace4-11e7-7088-f45c898df8f7">
    <name>ДатаДокументаИБ</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868666-ace4-11e7-7088-f45c898df8f7">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="44868c92-ace4-11e7-7088-f45c898df8f7">
    <name>МестоХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/InformationRegisters/СекцииКладовщиков/СекцииКладовщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="781a52b6-91f0-4269-a9f6-6318173ceec5">
  <name>СекцииКладовщиков</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <dimensions extendedConfigurationObject="a7af1fbb-3166-45f9-95cd-e947aaf54ece">
    <name>Кладовщик</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ada791ba-7f50-4d94-960e-e5c5fbd64385">
    <name>Пользователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="93089e66-0030-429b-b7ec-8d8eca2e1bb0">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="26ee698b-2e6a-4d4b-9aa5-846e60bfab67">
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Enums/СтатусыПриходныхОрдеров/СтатусыПриходныхОрдеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="58ab352b-2fda-4618-8f5e-14d83c1300f2">
  <name>СтатусыПриходныхОрдеров</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="51091c69-7e1a-4e28-8412-c3a970faaf1d">
    <name>ВРаботе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fcb9b0b5-3360-47e9-bb41-297eaf6890d9">
    <name>ТребуетсяОбработка</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыЧековККМ/СтатусыЧековККМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыЧековККМ</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Пробит</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="994ecf6c-34a9-4274-952e-8a44959ddd3d">
    <name>КОплате</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="238e807a-b6d8-401c-b115-0e10b84a16c1">
    <name>ОтложенБезРезервирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b8d448b2-f4c4-4fef-bd83-69bf834a37d5">
    <name>ОтложенСРезервированием</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Catalogs/СкладскиеЯчейки/СкладскиеЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СкладскиеЯчейки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <owners>Checked</owners>
  </extension>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Склады</owners>
  <attributes>
    <name>РабочийУчасток</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="066e30f6-7b05-4707-b88c-048e47e0ee62">
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>39</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f3e5dfce-ce94-489f-bbc6-ba1b699e6a56">
    <name>ИспользованиеПериодичностиИнвентаризацииЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b7afe322-1954-42ee-b9f7-20803df9f4db">
    <name>КоличествоДнейМеждуИнвентаризациями</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="942b70ab-8729-495e-aa2e-e362fab7ecfd">
    <name>ТипСкладскойЯчейки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c08d78e7-8199-4896-a9fc-9ac0cb946bff">
    <name>Помещение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="60091b4d-b59a-402b-8b0a-8f53fca6515a">
    <name>Секция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>4</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c4e170cc-c732-4607-8975-9c5a1ff87d55">
    <name>Линия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a5ca5828-4e29-461b-885b-7139ab2b8f0d">
    <name>Стеллаж</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>5</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="56a97705-349f-4913-8e45-02a642ba3195">
    <name>ПорядокОбхода</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ea064545-91fd-46da-987c-a068e1b5f13f">
    <name>Ярус</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc923ed7-93a9-4ab2-80bf-95d378dac70c">
    <name>Позиция</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>2</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="82b6a5ac-4bdb-4046-b405-1382915a4c74">
    <name>УровеньДоступности</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b4a34412-3576-4048-b17b-40befc421c3f">
    <name>Типоразмер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61217d52-e955-4b33-bc99-11d43aa1c1d9">
    <name>ОбластьХранения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="63793c84-fe0a-46a7-b089-23086db66ef4">
    <name>МаксимальныйКоэффициентНаполненностиПоОбъему</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="45830319-bd9f-49d6-afc3-425511de0559">
    <name>МаксимальныйКоэффициентНаполненностиПоВесу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/DataProcessors/УправлениеПоступлением_Альтерра/Forms/ФормаПоступлений/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
		
	ОбщегоНазначенияУТ.НастроитьПодключаемоеОборудование(ЭтаФорма, "Поступления");
	
	ЗаполнитьСкладПоУмолчанию();
	
	ДатаПоступления.ДатаНачала = НачалоМесяца(ТекущаяДата());
	ДатаПоступления.ДатаОкончания = КонецМесяца(ТекущаяДата());

	ФильтрОрдеров = "КПриемке";
		
	СтруктураБыстрогоОтбора = Неопределено;
	Параметры.Свойство("СтруктураБыстрогоОтбора", СтруктураБыстрогоОтбора);
	
	Если СтруктураБыстрогоОтбора <> Неопределено Тогда
		
		СтруктураБыстрогоОтбора.Свойство("Склад", Склад);
		СтруктураБыстрогоОтбора.Свойство("ОтборРаспоряжений", ОтборРаспоряжений);
				
	КонецЕсли;
	
	СкладПомещениеПриИзмененииСервер();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	СписокТипов = ОрдераВРаботе.КомпоновщикНастроек.Настройки.Выбор.ДоступныеПоляВыбора.НайтиПоле(Новый ПолеКомпоновкиДанных("Ссылка")).Тип;
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения();
	ПараметрыРазмещения.Источники = СписокТипов;
	ПараметрыРазмещения.КоманднаяПанель = Элементы.ОрдераВРаботеГруппаКоманднаяПанель;
	ПараметрыРазмещения.ПрефиксГрупп = "ОрдераВРаботе";
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
	
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтаФорма, "СканерШтрихкода");
	ИспользоватьРасширенныйОтборПоСостояниямПриИзменении(Неопределено);
КонецПроцедуры           

#Область РаботаСОтборомПоСостоянию

&НаКлиенте
Процедура ИспользоватьРасширенныйОтборПоСостояниямПриИзменении(Элемент)
	Элементы.СостояниеСписок.Видимость = ИспользоватьРасширенныйОтборПоСостояниям;
	Элементы.Состояние.Видимость = Не ИспользоватьРасширенныйОтборПоСостояниям;
	СостояниеПриИзменении(Неопределено);
КонецПроцедуры      

&НаКлиенте
Процедура СостояниеПриИзменении(Элемент)	 
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление()); 
КонецПроцедуры

&НаКлиенте
Процедура СостояниеСписокНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка) 
	
	СтандартнаяОбработка = Ложь;        
	
	СостояниеСписок_ = Элементы.Состояние.СписокВыбора.Скопировать();
	Для Каждого Элемент Из СостояниеСписок Цикл
		Элемент_ = СостояниеСписок_.НайтиПоЗначению(Элемент.Значение);
		Если Элемент_ <> Неопределено Тогда
			Элемент_.Пометка = Истина;
		КонецЕсли;
	КонецЦикла;

	//СостояниеСписок_.ПоказатьОтметкуЭлементов(
	//    Новый ОписаниеОповещения("ОткрытьПараметрыЗавершение", ЭтотОбъект),
	//    "Выберите необходимые значения");
		
	ОткрытьФорму(
		"Обработка.УправлениеПоступлением_Альтерра.Форма.ФормаВыбораСостояний",
		Новый Структура("СостояниеСписок", СостояниеСписок_),
		ЭтаФорма,
		,
		,
		,
		Новый ОписаниеОповещения("ОткрытьПараметрыЗавершение", ЭтотОбъект));

КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьПараметрыЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СостояниеСписок.Очистить();
		Для Каждого Элемент Из Результат Цикл
			СостояниеСписок.Добавить(Элемент.Значение, Элемент.Представление);
		КонецЦикла;
	КонецЕсли;
	
	СостояниеПриИзменении(Неопределено);
КонецПроцедуры   

&НаСервере
Процедура ДобавитьСостоянияВТекстЗапроса(Запрос)
	МассивСостояний = Новый Массив;
	Если ИспользоватьРасширенныйОтборПоСостояниям Тогда
		МассивСостояний = СостояниеСписок.ВыгрузитьЗначения();	
	Иначе
		МассивСостояний.Добавить(Состояние);
	КонецЕсли;          
	
	Обработки.УправлениеПоступлением_Альтерра.ДобавитьСостоянияВТекстЗапроса(Запрос, МассивСостояний);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" И МенеджерОборудованияУТКлиент.ЕстьНеобработанноеСобытие() Тогда
			ОбработатьШтрихкоды(МенеджерОборудованияУТКлиент.ПреобразоватьДанныеСоСканераВСтруктуру(Параметр));
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#Область ОбработчикиСобытийЭлементовТаблицыФормыРаспоряженияНаПоступление

&НаКлиенте
Процедура РаспоряженияНаПоступлениеПриАктивизацииСтроки(Элемент)
	
	УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление());
	
	ТекущаяСтрока = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущаяСтрока<>Неопределено Тогда
		
		СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
		ТекущийРабочийУчасток =ТекущаяСтрока.РабочийУчасток; 
		
		Если ОтображатьТовары Тогда
			ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
		КонецЕсли;
		
		Если ОтображатьОрдераПоТекущемуРаспоряжению Тогда
			 ЗаполнитьОрдераПоТекРаспоряжению(РаспоряжениеНаПоступление());
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РаспоряженияНаПоступлениеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Распоряжение);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Функция РаспоряжениеНаПоступление()
	
	Если Элементы.РаспоряженияНаПоступление.ТекущиеДанные <> Неопределено Тогда
		Возврат Элементы.РаспоряженияНаПоступление.ТекущиеДанные.Распоряжение;
	КонецЕсли;
	
	Возврат ПредопределенноеЗначение("Документ.ПриобретениеТоваровУслуг.ПустаяСсылка");
	
КонецФункции

&НаСервере
Процедура УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление)
	
	СписокТипов = Новый СписокЗначений;
	СписокТипов.Добавить(Тип("ДокументСсылка.ПриходныйОрдерНаТовары"));
	СписокТипов.Добавить(Тип("ДокументСсылка.ОрдерНаПеремещениеТоваров"));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Тип", СписокТипов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Склад", Склад, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка.РабочийУчасток", РабочиеУчастки, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
	
	СписокСтатусов = Новый СписокЗначений;
	СписокСтатусов.Добавить(Перечисления.СтатусыПриходныхОрдеров.КПоступлению);
	СписокСтатусов.Добавить(Перечисления.СтатусыПриходныхОрдеров.ВРаботе);
	СписокСтатусов.Добавить(Перечисления.СтатусыПриходныхОрдеров.ТребуетсяОбработка);
	СписокСтатусов.Добавить(Перечисления.СтатусыОрдеровНаПеремещение.КОтгрузке);
	
	Если ФильтрОрдеров = "" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
	ИначеЕсли ФильтрОрдеров = "КПриемке" Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", Неопределено, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина, ВидСравненияКомпоновкиДанных.Равно,,Истина);
	ИначеЕсли ФильтрОрдеров = "ПоТекущемуРаспоряжению" Тогда	
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Статус", СписокСтатусов, ВидСравненияКомпоновкиДанных.ВСписке,,Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Проведен", Истина, ВидСравненияКомпоновкиДанных.Равно,,Ложь);
		ПриходныеОрдера = ПриходныеОрдераПоРаспоряжению(РаспоряжениеНаПоступление);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераВРаботе, "Ссылка", ПриходныеОрдера, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);									
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПриходныеОрдераПоРаспоряжению(Распоряжение)

	Запрос = Новый Запрос;
	Запрос.Текст = 		
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходныйОрдерНаТовары.Ссылка
	|ИЗ
	|	Документ.ПриходныйОрдерНаТовары КАК ПриходныйОрдерНаТовары
	|ГДЕ
	|	ПриходныйОрдерНаТовары.Распоряжение = &Распоряжение";
	
	Запрос.УстановитьПараметр("Распоряжение", Распоряжение);	
	ПриходныеОрдера = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат ПриходныеОрдера;
	
КонецФункции

Процедура ЗаполнитьСкладПоУмолчанию()
	
	СтруктураЗаполнения = Новый Структура("Склад");
	ОбщегоНазначенияУТ.ОбработкаЗаполнения(СтруктураЗаполнения, Неопределено, Неопределено);
	Склад = СтруктураЗаполнения.Склад;
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Склад = ЗначениеНастроекПовтИсп.ПолучитьСкладПоУмолчанию(Склад);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СкладПомещениеПриИзмененииСервер()
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	Если ЗначениеЗаполнено(Склад) Тогда
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Склад);			
	Иначе
		СтруктураУстанавливаемыхПараметров.Вставить("Склад",Неопределено);
	КонецЕсли;
	
	РабочиеУчастки.Очистить();
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	ИспользоватьСтатусыПриходныхОрдеров = ПолучитьФункциональнуюОпцию("ИспользоватьСтатусыПриходныхОрдеров", Новый Структура("Склад", Склад));
	
	УстановитьОтборыВОсновныхСписках();
	
КонецПроцедуры

Процедура УстановитьОтборыВОсновныхСписках()
	
	ЗаполнитьРаспоряженияНаПоступление();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРаспоряженияНаПоступление()
	
	Если Не ЗначениеЗаполнено(Склад) Тогда
		РаспоряженияНаПоступление.Очистить();
		Возврат;
	КонецЕсли;
	
	Если Не Пользователи.ЭтоПолноправныйПользователь(Неопределено) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Склады.Ссылка
		|ИЗ
		|	Справочник.Склады КАК Склады
		|ГДЕ
		|	Склады.Ссылка = &Склад";
		
		Запрос.УстановитьПараметр("Склад", Склад);
		
		Если Запрос.Выполнить().Пустой() Тогда
			РаспоряженияНаПоступление.Очистить();
			Возврат;
		КонецЕсли;
		
		УстановитьПривилегированныйРежим(Истина);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТоварыКПоступлению.ДокументПоступления КАК ДокументПоступления
	|ПОМЕСТИТЬ Распоряжения
	|ИЗ
	|	РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлению
	|ГДЕ
	|	ВЫБОР
	|		КОГДА &ИспользоватьОтборПоДате
	|			ТОГДА ТоварыКПоступлению.ДокументПоступления.Дата МЕЖДУ &ДатаПоступленияНачало И &ДатаПоступления
	|		ИНАЧЕ ТоварыКПоступлению.Период МЕЖДУ &ДатаПоступленияНачало И &ДатаПоступления
	|	КОНЕЦ
	|	И ТоварыКПоступлению.Склад = &Склад
	|	И НЕ (ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказНаПеремещение
	|	ИЛИ ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказНаСборку
	|	ИЛИ (ТоварыКПоступлению.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	|	И ВЫРАЗИТЬ(ТоварыКПоступлению.ДокументПоступления КАК
	|		Документ.ЗаказПоставщику).Договор.ВариантПриемкиТоваров = ЗНАЧЕНИЕ(Перечисление.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Распоряжения.ДокументПоступления КАК ДокументПоступления,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад КАК Склад,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстаткиНаДату.Назначение КАК Назначение,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК ЯчейкаРабочийУчасток,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика КАК Характеристика,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеров
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КОформлениюОрдеровПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерам
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КОформлениюПоступленийПоОрдерамПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.Принимается
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ПринимаетсяПриход,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеров
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КОформлениюОрдеровРасход,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюПоступленийПоОрдерам
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК КОформлениюПоступленийПоОрдерамРасход,
	|	СУММА(ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.Принимается
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК ПринимаетсяРасход
	|ПОМЕСТИТЬ ТоварыКПоступлениюОстаткиНаДату
	|ИЗ
	|	Распоряжения КАК Распоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыКПоступлению КАК ТоварыКПоступлениюОстаткиНаДату
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК
	|				РазмещениеНоменклатурыПоСкладскимЯчейкам
	|			ПО ТоварыКПоступлениюОстаткиНаДату.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
	|			И ТоварыКПоступлениюОстаткиНаДату.Склад = РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад
	|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
	|		ПО Распоряжения.ДокументПоступления = ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления
	|ГДЕ
	|	ВЫБОР
	|		КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
	|			ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток В (&РабочиеУчастки)
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|СГРУППИРОВАТЬ ПО
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель,
	|	ТоварыКПоступлениюОстаткиНаДату.Склад,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация,
	|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика,
	|	ТоварыКПоступлениюОстаткиНаДату.Назначение,
	|	Распоряжения.ДокументПоступления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Склад,
	|	ДокументПоступления,
	|	Отправитель,
	|	ХозяйственнаяОперация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Распоряжение,
	|	ТоварыКПоступлениюОстаткиНаДату.Отправитель КАК Отправитель,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Документ.ЗаказПоставщику
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Контрагент
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.Отправитель
	|	КОНЕЦ КАК ОтправительКонтрагент,
	|	ТоварыКПоступлениюОстаткиНаДату.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТоварыКПоступлениюОстаткиНаДату.Номенклатура КАК Номенклатура,
	|	ТоварыКПоступлениюОстаткиНаДату.Характеристика КАК Характеристика,
	|	ТоварыКПоступлениюОстаткиНаДату.ЯчейкаРабочийУчасток КАК ЯчейкаРабочийУчасток,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.Назначение = ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ЕстьНазначение,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК
	|				Справочник.СоглашенияСПоставщиками).Номер КАК СТРОКА(11))
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ВЫРАЗИТЬ(ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК
	|				Справочник.ДоговорыКонтрагентов).Номер КАК СТРОКА(11))
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Номер
	|	КОНЕЦ КАК Номер,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|			ТОГДА ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.СоглашенияСПоставщиками).Дата
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ВЫРАЗИТЬ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления КАК Справочник.ДоговорыКонтрагентов).Дата
	|		ИНАЧЕ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Дата
	|	КОНЕЦ КАК Дата,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|		ИЛИ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА """"
	|		ИНАЧЕ ЕСТЬNULL(РеестрДокументов.НомерПервичногоДокумента, """")
	|	КОНЕЦ КАК НомерВходящегоДокумента,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.СоглашенияСПоставщиками
	|		ИЛИ ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
	|		ИНАЧЕ ЕСТЬNULL(РеестрДокументов.ДатаПервичногоДокумента, ДАТАВРЕМЯ(1, 1, 1))
	|	КОНЕЦ КАК ДатаВходящегоДокумента,
	|	ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) КАК ТипДокумента,
	|	ВЫБОР
	|		КОГДА
	|			ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход
	|		И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КПриемке,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход -
	|			ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход > 0
	|		И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПринятЧастично,
	|	ВЫБОР
	|		КОГДА
	|			ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход <= ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход
	|		И ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принят,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход > ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяРасход
	|		И ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход > 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Принимается,
	|	ВЫБОР
	|		КОГДА ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровПриход -
	|			ТоварыКПоступлениюОстаткиНаДату.КОформлениюОрдеровРасход - (ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяПриход -
	|			ТоварыКПоступлениюОстаткиНаДату.ПринимаетсяРасход) < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Перепоставка,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.ВозвратТоваровОтКлиента)
	|		ИЛИ ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.КорректировкаРеализации)
	|			ТОГДА ВЫБОР
	|				КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Кассир = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|					ТОГДА ЛОЖЬ
	|				ИНАЧЕ ИСТИНА
	|			КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|			КОГДА ТИПЗНАЧЕНИЯ(ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления) = ТИП(Документ.ЧекККМВозврат)
	|				ТОГДА ВЫБОР
	|					КОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	КОНЕЦ КАК ОтметкаКассы,
	|	РеестрДокументов.Комментарий КАК Комментарий
	|ПОМЕСТИТЬ ВТ_Распоряжения
	|ИЗ
	|	ТоварыКПоступлениюОстаткиНаДату КАК ТоварыКПоступлениюОстаткиНаДату
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеестрДокументов КАК РеестрДокументов
	|		ПО ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления = РеестрДокументов.Ссылка
	|		И (НЕ РеестрДокументов.ДополнительнаяЗапись)
	|ГДЕ
	|	ВЫБОР
	|		КОГДА НЕ &Номер = """"""""
	|			ТОГДА ТоварыКПоступлениюОстаткиНаДату.ДокументПоступления.Номер ПОДОБНО ""%"" + &Номер + ""%""
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Распоряжения.Распоряжение КАК Распоряжение,
	|	ВТ_Распоряжения.Отправитель КАК Отправитель,
	|	ВТ_Распоряжения.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ВТ_Распоряжения.Номер КАК Номер,
	|	ВТ_Распоряжения.Дата КАК Дата,
	|	ВТ_Распоряжения.НомерВходящегоДокумента КАК НомерВходящегоДокумента,
	|	ВТ_Распоряжения.ДатаВходящегоДокумента КАК ДатаВходящегоДокумента,
	|	ВТ_Распоряжения.ЯчейкаРабочийУчасток КАК РабочийУчасток,
	|	Рейсы.Ссылка КАК Рейс,
	|	МАКСИМУМ(ВТ_Распоряжения.КПриемке) КАК КПриемке,
	|	МАКСИМУМ(ВТ_Распоряжения.ПринятЧастично) КАК ПринятЧастично,
	|	МИНИМУМ(ВТ_Распоряжения.Принят) КАК Принят,
	|	МАКСИМУМ(ВТ_Распоряжения.Принимается) КАК Принимается,
	|	МАКСИМУМ(ВТ_Распоряжения.Перепоставка) КАК Перепоставка,
	|	ВТ_Распоряжения.ОтметкаКассы КАК ОтметкаКассы,
	|	ВТ_Распоряжения.ТипДокумента КАК ТипДокумента,
	|	ВТ_Распоряжения.ОтправительКонтрагент КАК ОтправительКонтрагент,
	|	МАКСИМУМ(ВТ_Распоряжения.ЕстьНазначение) КАК ЕстьНазначение,
	|	МАКСИМУМ(ВТ_Распоряжения.Комментарий) КАК Комментарий
	|ИЗ
	|	ВТ_Распоряжения КАК ВТ_Распоряжения
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка КАК Ссылка,
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.ДокументПродажи КАК ДокументПродажи
	|		ИЗ
	|			Документ.ЗаданиеНаПеревозкуРейс.РасчетДоставки КАК ЗаданиеНаПеревозкуРейсРасчетДоставки
	|		ГДЕ
	|			ЗаданиеНаПеревозкуРейсРасчетДоставки.Ссылка.Проведен = ИСТИНА
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РейсОтПоставщикаРасчетДоставки.Ссылка,
	|			РейсОтПоставщикаРасчетДоставки.ДокументОснование
	|		ИЗ
	|			Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ГДЕ
	|			РейсОтПоставщикаРасчетДоставки.Ссылка.Проведен = ИСТИНА
	|
	|		ОБЪЕДИНИТЬ ВСЕ
	|
	|		ВЫБРАТЬ
	|			РейсСиламиПоставщикаОснования.Ссылка,
	|			РейсСиламиПоставщикаОснования.Документ
	|		ИЗ
	|			Документ.РейсСиламиПоставщика.Основания КАК РейсСиламиПоставщикаОснования
	|		ГДЕ
	|			РейсСиламиПоставщикаОснования.Ссылка.Проведен = ИСТИНА) КАК Рейсы
	|		ПО ВТ_Распоряжения.Распоряжение = Рейсы.ДокументПродажи
	|ГДЕ
	|	&Условие
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Распоряжения.Распоряжение,
	|	ВТ_Распоряжения.Отправитель,
	|	ВТ_Распоряжения.ХозяйственнаяОперация,
	|	ВТ_Распоряжения.ЯчейкаРабочийУчасток,
	|	Рейсы.Ссылка,
	|	ВТ_Распоряжения.ОтметкаКассы,
	|	ВТ_Распоряжения.ТипДокумента,
	|	ВТ_Распоряжения.Дата,
	|	ВТ_Распоряжения.ДатаВходящегоДокумента,
	|	ВТ_Распоряжения.Номер,
	|	ВТ_Распоряжения.НомерВходящегоДокумента,
	|	ВТ_Распоряжения.ОтправительКонтрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Номер,
	|	ТипДокумента";
	
	Запрос.УстановитьПараметр("РабочиеУчастки", РабочиеУчастки.ВыгрузитьЗначения());
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ИспользоватьОтборПоДате", ?(ИспользоватьОтборПоДатеДокумента="0",Истина,Ложь));
	Запрос.УстановитьПараметр("Номер", ПоискПоНомеру);
	
	Если  ИспользоватьОтборПоДатеДокумента = "0" Тогда
		
		Если ЗначениеЗаполнено(ПериодПоДатеДокумента) Тогда
			Запрос.УстановитьПараметр("ДатаПоступления", КонецДня(ПериодПоДатеДокумента.ДатаОкончания)); 
			Запрос.УстановитьПараметр("ДатаПоступленияНачало", НачалоДня(ПериодПоДатеДокумента.ДатаНачала)); 
		Иначе
			Запрос.УстановитьПараметр("ДатаПоступления", КонецДня(ТекущаяДата())); 
			Запрос.УстановитьПараметр("ДатаПоступленияНачало", НачалоДня(ТекущаяДата())); 
		КонецЕсли;
		
	Иначе
		
		Если ЗначениеЗаполнено(ДатаПоступления) Тогда
			Запрос.УстановитьПараметр("ДатаПоступления", КонецДня(ДатаПоступления.ДатаОкончания)); 
			Запрос.УстановитьПараметр("ДатаПоступленияНачало", НачалоДня(ДатаПоступления.ДатаНачала)); 
		Иначе
			Запрос.УстановитьПараметр("ДатаПоступления", КонецДня(ТекущаяДата())); 
			Запрос.УстановитьПараметр("ДатаПоступленияНачало", НачалоДня(ТекущаяДата())); 
		КонецЕсли;
		
	КонецЕсли;   
	
	ДобавитьСостоянияВТекстЗапроса(Запрос);
		
	// Запомним текущую строку таблицы распоряжений
	Если ЗначениеЗаполнено(Элементы.РаспоряженияНаПоступление.ТекущаяСтрока) Тогда
		ТекущаяСтрокаРаспоряженияНаОтгрузку = 
			РаспоряженияНаПоступление.НайтиПоИдентификатору(Элементы.РаспоряженияНаПоступление.ТекущаяСтрока);
		Если ТекущаяСтрокаРаспоряженияНаОтгрузку <> Неопределено Тогда
			ТекущееРаспоряжение = ТекущаяСтрокаРаспоряженияНаОтгрузку.Распоряжение;
		КонецЕсли;
	Иначе
		ТекущееРаспоряжение = Неопределено;
	КонецЕсли;
	
	РаспоряженияНаПоступление.Загрузить(Запрос.Выполнить().Выгрузить());
	
	// Восстановим текущую строку
	Если ЗначениеЗаполнено(ТекущееРаспоряжение) Тогда
		Строки = РаспоряженияНаПоступление.НайтиСтроки(Новый Структура("Распоряжение", ТекущееРаспоряжение));
		Если Строки.Количество() > 0 Тогда
			Элементы.РаспоряженияНаПоступление.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

#Область ШтрихкодыИТорговоеОборудование

&НаКлиенте
Функция СсылкаНаЭлементСпискаПоШтрихкоду(Штрихкод)
	
	Менеджеры = Новый Массив();
	Менеджеры.Добавить(ПредопределенноеЗначение("Документ.ОтборРазмещениеТоваров.ПустаяСсылка"));
	Возврат ШтрихкодированиеПечатныхФормКлиент.ПолучитьСсылкуПоШтрихкодуТабличногоДокумента(Штрихкод, Менеджеры);
	
КонецФункции

&НаКлиенте
Процедура ОбработатьШтрихкоды(Данные)
	
	МассивСсылок = СсылкаНаЭлементСпискаПоШтрихкоду(Данные.Штрихкод);
	Если МассивСсылок.Количество() > 0 Тогда
		Ссылка = МассивСсылок[0];
		Элементы.ЗаданияВРаботе.ТекущаяСтрока = Ссылка;
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.СтраницаРазмещение;
		ПоказатьЗначение(Неопределено, Ссылка);
	Иначе
		ШтрихкодированиеПечатныхФормКлиент.ОбъектНеНайден(Данные.Штрихкод);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
&НаСервере
Процедура ИзменениеСпискаОрдераВРаботе(РаспоряжениеНаПоступление) 
	ЗаполнитьРаспоряженияНаПоступление();
	УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление);
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеПоступлением.Форма.Элемент.Склад.ПриИзменении");
	
	СкладПриИзмененииСервер(РаспоряжениеНаПоступление());		
	
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер(РаспоряжениеНаПоступление)
	СкладПомещениеПриИзмененииСервер();
	УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление);
КонецПроцедуры

&НаКлиенте
Процедура ФильтрОрдеровПриИзменении(Элемент)
	УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление());
КонецПроцедуры

&НаКлиенте
Процедура ДатаПоступленияПриИзменении(Элемент)
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление)
	
	УстановитьОтборыВОсновныхСписках();
	УстановитьОтборыВЗависимыхСписках(РаспоряжениеНаПоступление);
	
		
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрдер(Команда)
	
	// &ЗамерПроизводительности
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина,
		"Обработка.УправлениеПоступлением.Форма.Команда.СоздатьОрдер");

	ОчиститьСообщения();
	ТекущиеДанные = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда

		Основание = Новый Структура;
		Основание.Вставить("Распоряжение",               ТекущиеДанные.Распоряжение);
		Основание.Вставить("Отправитель",                ТекущиеДанные.Отправитель);
		Основание.Вставить("Склад",                      Склад);
		Основание.Вставить("ДатаВходящегоДокумента",     ТекущиеДанные.ДатаВходящегоДокумента);
		Основание.Вставить("НомерВходящегоДокумента",    ТекущиеДанные.НомерВходящегоДокумента);
		Основание.Вставить("ДатаПоступления",            ТекущаяДата());
		Основание.Вставить("ХозяйственнаяОперация",      ТекущиеДанные.ХозяйственнаяОперация);
		Основание.Вставить("РабочийУчасток",      ТекущиеДанные.РабочийУчасток);
		Основание.Вставить("Товары", Товары);
		ОткрытьФорму("Документ.ПриходныйОрдерНаТовары.Форма.ФормаДокумента",
					Новый Структура("Основание",Основание));
		
	Иначе
			
		ТекстПредупреждения = НСтр("ru = 'Выберите распоряжение на поступление товаров.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьТовары()
	Возврат Товары.Выгрузить();
Конецфункции

&НаКлиенте
Процедура ОрдераВРаботеПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьДополнительныеТаблицы();

КонецПроцедуры

Процедура ЗаполнитьТовары(ЭтоОрдер,СсылкаНаДокумент)
	
	Товары.Очистить();
	Если ЭтоОрдер Тогда
		Если СсылкаНаДокумент.Проведен Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество
		|ПОМЕСТИТЬ ВнешняяТаблицаНоменклатуры
		|ИЗ
		|	&ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешняяТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
		|	ВнешняяТаблицаНоменклатуры.Характеристика КАК Характеристика,
		|	ВнешняяТаблицаНоменклатуры.Количество КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток КАК Секция,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	ВнешняяТаблицаНоменклатуры КАК ВнешняяТаблицаНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ВнешняяТаблицаНоменклатуры.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = &Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ";		
		
		Запрос.УстановитьПараметр("ВнешняяТаблицаНоменклатуры",СсылкаНаДокумент.Товары.Выгрузить());
		Запрос.УстановитьПараметр("Склад",Склад);
		Запрос.УстановитьПараметр("РабочиеУчастки",СсылкаНаДокумент.РабочийУчасток);
		Товары.Загрузить(Запрос.Выполнить().Выгрузить());
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыКПоступлениюОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыКПоступлениюОстатки.Характеристика КАК Характеристика,
		|	ТоварыКПоступлениюОстатки.КОформлениюОрдеровОстаток КАК Количество,
		|	РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрНакопления.ТоварыКПоступлению.Остатки КАК ТоварыКПоступлениюОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам КАК РазмещениеНоменклатурыПоСкладскимЯчейкам
		|		ПО ТоварыКПоступлениюОстатки.Номенклатура = РазмещениеНоменклатурыПоСкладскимЯчейкам.Номенклатура
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.Склад = ТоварыКПоступлениюОстатки.Склад)
		|			И (РазмещениеНоменклатурыПоСкладскимЯчейкам.ОсновнаяЯчейка = ИСТИНА)
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка ЕСТЬ NULL
		|				ТОГДА РазмещениеНоменклатурыПоСкладскимЯчейкам.Ячейка.РабочийУчасток = &РабочиеУчастки
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|	И 
		|ТоварыКПоступлениюОстатки.ДокументПоступления = &ДокументПоступления";
		
		Запрос.УстановитьПараметр("ДокументПоступления",СсылкаНаДокумент);
		Запрос.УстановитьПараметр("РабочиеУчастки",ТекущийРабочийУчасток);
        Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьТоварыПриИзменении(Элемент)
	Элементы.Группа4.Видимость = ОтображатьТовары;
	ЗаполнитьДополнительныеТаблицы();

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	Список = Элементы.ОрдераВРаботе;
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	Список = Элементы.ОрдераВРаботе;
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	Список = Элементы.ОрдераВРаботе;

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Группа1ПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "Группа2" Тогда
		ТекущаяСтрока = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Распоряжение;
			ЗаполнитьТовары(Ложь,СсылкаНаДокумент);
		КонецЕсли;	
	Иначе
		ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
		Если ТекущаяСтрока<>Неопределено Тогда
			СсылкаНаДокумент = ТекущаяСтрока.Ссылка;
			ЗаполнитьТовары(Истина,СсылкаНаДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОрдераПоТекущемуРаспоряжениюПриИзменении(Элемент)
	Элементы.Группа6.Видимость=ОтображатьОрдераПоТекущемуРаспоряжению;
	
	ЗаполнитьДополнительныеТаблицы();

КонецПроцедуры

Процедура ЗаполнитьОрдераПоТекРаспоряжению(РаспоряжениеНаПоступление)
ПриходныеОрдера = ПриходныеОрдераПоРаспоряжению(РаспоряжениеНаПоступление);
ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(ОрдераПоТекущемуРаспоряжению, "Ссылка", ПриходныеОрдера, ВидСравненияКомпоновкиДанных.ВСписке,,Истина);									
КонецПроцедуры

&НаКлиенте
Процедура РабочиеУчасткиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; 
	
	РабочиеУчастки.Очистить();
	
	ПараметрыОтбора =  Новый Структура;
	ЗначениеОтбора =  Новый Структура;
	ЗначениеОтбора.Вставить("Владелец", Склад);
	ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
	ПараметрыОтбора.Вставить("Отбор", ЗначениеОтбора);
	ПараметрыОтбора.Вставить("МножественныйВыбор", Истина);
	Форма = ОткрытьФорму("Справочник.РабочиеУчастки.ФормаВыбора",ПараметрыОтбора , Элемент);
	
	Если ЕстьРабочиеУчасткиПользователя() Тогда
		
		ОтборВладелец = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных")); 
		ОтборВладелец.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке; 
		ОтборВладелец.Использование = Истина; 
		ОтборВладелец.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Ссылка"); 
		ОтборВладелец.ПравоеЗначение = ПолучитьРабочиеУчасткиПользователя();    
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ЕстьРабочиеУчасткиПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СекцииКладовщиков.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.СекцииКладовщиков КАК СекцииКладовщиков
		|ГДЕ
		|	СекцииКладовщиков.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
КонецФункции

&НаСервере
Функция ПолучитьРабочиеУчасткиПользователя()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СекцииКладовщиков.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.СекцииКладовщиков КАК СекцииКладовщиков
		|ГДЕ
		|	СекцииКладовщиков.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	РезультатЗапросаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивЗначений = Новый Массив();
	
	Пока РезультатЗапросаДетальныеЗаписи.Следующий() Цикл
		МассивЗначений.Добавить(РезультатЗапросаДетальныеЗаписи.Ячейка);
	КонецЦикла;
	
	Возврат МассивЗначений;
КонецФункции

&НаКлиенте
Процедура РабочиеУчасткиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Для Каждого Элем из ВыбранноеЗначение цикл
	 РабочиеУчастки.Добавить(Элем);
	Конеццикла; 
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДополнительныеТаблицы()
		
	Распоряжение = Ложь;
	
	Если Элементы.Группа1.ТекущаяСтраница.Имя = "Группа2" Тогда
		ТекущаяСтрока = Элементы.РаспоряженияНаПоступление.ТекущиеДанные;
		Распоряжение = Истина;
	Иначе
		ТекущаяСтрока = Элементы.ОрдераВРаботе.ТекущиеДанные;
		Распоряжение = Ложь;
	КонецЕсли;

	Если ТекущаяСтрока<>Неопределено Тогда
		
		СсылкаНаДокумент = ?(Распоряжение,ТекущаяСтрока.Распоряжение,ТекущаяСтрока.Ссылка);
		
		Если Распоряжение Тогда
		ТекущийРабочийУчасток =ТекущаяСтрока.РабочийУчасток; 
	    КонецЕсли;
	
		Если ОтображатьТовары Тогда
			ЗаполнитьТовары(Не Распоряжение,СсылкаНаДокумент);
		КонецЕсли;
		
		Если ОтображатьОрдераПоТекущемуРаспоряжению И Распоряжение Тогда
			 ЗаполнитьОрдераПоТекРаспоряжению(РаспоряжениеНаПоступление());
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле = Элементы.ТоварыЯчейка Тогда 
		
		ТекЯч = Элемент.ТекущиеДанные.Ячейка;
		
		ПараметрыОтбора =  Новый Структура;
		ЗначениеОтбора =  Новый Структура;
		ЗначениеОтбора.Вставить("Владелец", Склад);
		
		ЗначениеОтбора.Вставить("ПометкаУдаления", Ложь);
		ПараметрыОтбора.Вставить("Отбор", ЗначениеОтбора);
		ПараметрыОтбора.Вставить("МножественныйВыбор", Ложь);
		ОткрытьФорму("Справочник.СкладскиеЯчейки.ФормаВыбора",ПараметрыОтбора , Элемент);
		
	Иначе
		
		ПоказатьЗначение(Неопределено, Элемент.ТекущиеДанные.Номенклатура);
		
	КонецЕсли;

КонецПроцедуры

Функция ПолучимРабУч(ТекЯч)

	Возврат ТекЯч.РабочийУчасток;

КонецФункции

&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
    НоваяЯчейка(ВыбранноеЗначение, Склад, Элементы.Товары.ТекущиеДанные.Номенклатура);
    ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры
	
&НаСервере
Процедура НоваяЯчейка(Ячейка, Склад, Номенклатура)
	Набор = РегистрыСведений.РазмещениеНоменклатурыПоСкладскимЯчейкам.СоздатьНаборЗаписей();
	Набор.Отбор.Склад.Установить(Склад);
	Набор.Отбор.Номенклатура.Установить(Номенклатура);
	
	Набор.Прочитать();
	Если Набор.Количество() = 1 Тогда
		НоваяСтрока = Набор[0];	
    	НоваяСтрока.Ячейка = Ячейка;
		Попытка
			Набор.Записать(Истина);
		Исключение
			ЕстьОшибки = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить новую ячейку");
		КонецПопытки;
	ИначеЕсли Набор.Количество() = 0 Тогда
		
		 НоваяЗапись = Набор.Добавить(); 
		 НоваяЗапись.Номенклатура = Номенклатура;    
		 НоваяЗапись.Склад = Склад;  
         НоваяЗапись.Ячейка = Ячейка;
		 НоваяЗапись.ОсновнаяЯчейка = Истина;
        Попытка
			Набор.Записать(Истина);
		Исключение
			ЕстьОшибки = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить новую ячейку");
		КонецПопытки;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось установить новую ячейку");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПоискПоНомеруПриИзменении(Элемент)
	УстановитьОтборыВОсновныхСписках();
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьОтборПоДатеДокументаПриИзменении(Элемент)
	Элементы.ДатаПоступления.Доступность = ?(ИспользоватьОтборПоДатеДокумента="1",Истина,Ложь);
	Элементы.ПериодПоДатеДокумента.Доступность = ?(ИспользоватьОтборПоДатеДокумента="0",Истина,Ложь);
	УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
	ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПоДатеДокументаПриИзменении(Элемент)
		УстановитьОтборыВоВсехСписках(РаспоряжениеНаПоступление());
		ЗаполнитьДополнительныеТаблицы();
КонецПроцедуры
